# Список прикладів
examples = [
    [0, 1, 0, 12, 3],
    [0],
    [1, 0, 13, 0, 0, 0, 5],
    [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
]

# Проходимо по кожному прикладу
for lst in examples:
    result = []        # новий список для ненульових елементів
    zero_count = 0     # лічильник нулів

    # Перебір елементів у списку
    for num in lst:
        if num == 0:
            zero_count += 1    # підраховуємо кількість нулів
        else:
            result.append(num)  # додаємо ненульовий елемент

    # Додаємо нулі в кінець
    for i in range(zero_count):
        result.append(0)

    # Вивід результату
    print(f"{lst} -> {result}")
